Repository: Andy-AO/Ebook-Translator-Calibre-Plugin
Catalog: translations/*.po
Languages: tr

source: Ebook Translator
tr: E-kitap Çevirmeni

source: A Calibre plugin to translate ebook into a specified language (optionally keeping the original content).
tr: E-kitabı belirli bir dile çevirmek için bir Calibre eklentisi(isteğe bağlı olarak orijinal içeriği korur).

source: Extracting ebook content...
tr: E-kitap içeriği çıkarılıyor...

source: Failed to extract ebook content
tr: E-kitap içeriği çıkarılamadı

source: Filtering ebook content...
tr: E-kitap içeriği filtreleniyor...

source: Preparing user interface...
tr: Kullanıcı arayüzü hazırlanıyor...

source: Start
tr: Başlat

source: Input Format
tr: Giriş Formatı

source: Target Language
tr: Hedef Dil

source: Encoding
tr: Kodlama

source: Failed to translate {} paragraph(s), Would you like to retry?
tr: {} paragrafın çevirisi başarısız oldu, Tekrar denemek ister misiniz?

source: Translation completed.
tr: Çeviri tamamlandı.

source: There is no content that needs to be translated.
tr: Çeviri gerektiren bir içerik yok.

source: Loading ebook data, please wait...
tr: E-kitap verileri yükleniyor, lütfen bekleyin...

source: Review
tr: İnceleme

source: Log
tr: Günlük

source: Errors
tr: Hatalar

source: Total items: {}
tr: Toplam öğe: {}

source: Character count: {}
tr: Karakter sayısı: {}

source: Delete
tr: Sil

source: Translate All
tr: Tümünü Çevir

source: Translate Selected
tr: Seçilenleri Çevir

source: Stop
tr: Dur

source: Stopping...
tr: Duruyor...

source: Cache Status
tr: Önbellek Durumu

source: Disabled
tr: Devre Dışı

source: Enabled
tr: Etkin

source: Translation Engine
tr: Çeviri Motoru

source: Source Language
tr: Kaynak Dil

source: Custom Ebook Title
tr: Özel E-Kitap Başlığı

source: By default, title metadata will be translated.
tr: Varsayılan olarak başlık meta verileri çevrilecek.

source: Output Ebook
tr: E-kitap Çıktıları

source: Output
tr: Çıktı

source: Translated
tr: Çeviri

source: The ebook has not been translated yet.
tr: E-kitap henüz tercüme edilmedi.

source: The number of lines in some translation units differs between the original text and the translated text. Are you sure you want to output without checking alignment?
tr: Bazı çeviri birimlerindeki satır sayısı orijinalmetin ve çevrilmiş metin olmadan çıktı almak istediğinizden emin misiniz?Hizalamayı kontrol et.

source: No translation yet
tr: Henüz çeviri yok

source: Save
tr: Kaydet

source: Your changes have been saved.
tr: Değişiklikleriniz kaydedildi.

source: Translation log
tr: Çeviri günlüğü

source: Error log
tr: Hata günlüğü

source: Are you sure you want to translate all {:n} paragraphs?
tr: Tüm {:n} paragrafı çevirmek istediğinizden emin misiniz?

source: Are you sure you want to stop the translation progress?
tr: Çeviri ilerlemesini durdurmak istediğinizden emin misiniz?

source: Output Format
tr: Çıktı Formatı

source: Title
tr: Başlık

source: Translate
tr: Çevir

source: Unknown
tr: Bilinmiyor

source: The specified path does not exist.
tr: Belirtilen yol mevcut değil.

source: Choose a path to store cache files.
tr: Önbellek dosyalarını depolamak için bir yol seçin.

source: Choose
tr: Seç

source: Reset
tr: Sıfırla

source: Reveal
tr: Açıkla

source: Cache Path
tr: Önbellek Yolu

source: Clear All
tr: Hepsini Temizle

source: All cache(s) will be moved to the default path. Are you sure to proceed?
tr: Tüm önbellek(ler) varsayılan yola taşınacak.

source: All cache(s) will be moved to the new path. Are you sure to proceed?
tr: Tüm önbellekler yeni yola taşınacak.

source: Please choose an empty folder.
tr: Lütfen boş bir klasör seçin.

source: Are you sure you want to clear all caches?
tr: Tüm önbellekleri temizlemek istediğinizden emin misiniz?

source: No cache exists.
tr: Önbellek yok.

source: Total: {}
tr: Toplam: {}

source: Are you sure you want to delete the selected cache(s)?
tr: Seçili önbellekleri silmek istediğinizden emin misiniz?

source: Engine
tr: Motor

source: Language
tr: Dil

source: Merge Length
tr: Birleştirme Uzunluğu

source: Filename
tr: Dosya adı

source: Size (MB)
tr: Boyut (MB)

source: Translating...
tr: Çeviri yapılıyor...

source: Test Translation Engine
tr: Çeviri Motorunu Test Edin

source: Usage: checking...
tr: Kullanım: kontrol ediliyor...

source: Usage: {}
tr: Kullanım: {}

source: Custom Translation Engine
tr: Özel Çeviri Motoru

source: Add
tr: Ekle

source: Clear
tr: Temizle

source: Restore
tr: Geri Yükle

source: Verify
tr: Doğrula

source: Valid engine data format.
tr: Geçerli motor veri formatı.

source: The engine name is already in use.
tr: Motor adı zaten kullanılıyor.

source: The setting has been saved.
tr: Ayar kaydedildi.

source: Ebook Specific
tr: E-kitaba Özel

source: Donate
tr: Bağış yap

source: Feedback
tr: Geri bildirim

source: Auto detect
tr: Otomatik algılama

source: Choose a translation mode for clicking the icon button.
tr: Simge düğmesine tıklamak için bir çeviri modu seçin.

source: Advanced Mode
tr: Gelişmiş Mod

source: This mode provides additional options for the translation process, allowing for more control and customization.
tr: Bu mod, çeviri işlemi için ek seçenekler sağlayarakdaha fazla kontrol ve özelleştirme için.

source: Batch Mode
tr: Toplu Mod

source: This mode allows users to translate multiple ebooks at once, streamlining the translation process and saving time.
tr: Bu mod, kullanıcıların birden fazla e-kitabı aynı anda çevirmesine olanak tanıyarak çeviri sürecini kolaylaştırır ve zamandan tasarruf sağlar.

source: Original
tr: Orijinal

source: Status
tr: Durum

source: Untranslated
tr: çevrilmemiş

source: The number of lines differs between the original text and the translated text.
tr: Orijinal metin ile çevrilmiş metin arasındaki satır sayısı farklılık gösteriyor.

source: Select the whole chapter
tr: Tüm bölümü seç

source: Select similar paragraphs: {}="{}"
tr: Benzer paragrafları seç: {}="{}"

source: Retain at least one row.
tr: En az bir satırı koru.

source: Can not parse returned response. Raw data: {}
tr: Geri dönen yanıt ayrıştırılamıyor.

source: API Keys
tr: API Anahtarları

source: A correct key format "{}" is required.
tr: Doğru bir anahtar biçimi "{}" gerekli.

source: Engine data must be in valid JSON format.
tr: Motor verileri geçerli JSON formatında olmalıdır.

source: Invalid engine data.
tr: Geçersiz motor verileri.

source: Engine name is required.
tr: Motor adı gerekli.

source: Engine name must be different from builtin engine name.
tr: Motor adı yerleşik motor adından farklı olmalıdır.

source: Language codes are required.
tr: Dil kodları gerekli.

source: Source and target must be added in pair.
tr: Kaynak ve hedef çift olarak eklenmelidir.

source: Request information is required.
tr: İstek bilgisi gerekli.

source: API URL is required.
tr: API URL'si gerekli.

source: Placeholder <text> is required.
tr: Yer tutucu <metin> gerekli.

source: Request headers must be an JSON object.
tr: İstek üstbilgileri bir JSON nesnesi olmalıdır.

source: A appropriate Content-Type in headers is required.
tr: Başlıklarda uygun bir İçerik Türü gerekli.

source: Expression to parse response is required.
tr: Yanıtı ayrıştırmak için ifade gerekli.

source: Response was parsed incorrectly.
tr: Yanıt yanlış ayrıştırıldı.

source: {} total, {} used, {} left
tr: {} toplam, {} kullanıldı, {} kaldı

source: This plugin uses Application Default Credentials (ADC) in your local environment to access your Google Translate service. To set up the ADC, follow these steps: 1. Install the gcloud CLI by checking out its instructions {}. 2. Run the command: gcloud auth application-default login. 3. Sign in to your Google account and grant needed privileges.
tr: Bu eklenti, yerel bilgisayarınızdaki Uygulama Varsayılan Kimlik Bilgilerini (ADC) kullanırortamına Google Çeviri hizmetinize erişmek için. ADC'yi kurmak için şu adımları izleyin: 1. Talimatlarını kontrol ederek gcloud CLI'yi yükleyin {}. 2. Şu komutu çalıştırın: gcloud auth application-default login. 3. Google hesabınızda oturum açın ve gerekli ayrıcalıkları verin.

source: Cannot run the command "{}".
tr: "{}" komutu çalıştırılamıyor.

source: Cannot find the command "{}".
tr: "{}" komutu bulunamıyor.

source: Failed get APP key due to an invalid Token.
tr: Geçersiz bir Belirteç nedeniyle APP anahtarı alınamadı.

source: Failed get APP key due to and invalid Base64 URL.
tr: Geçersiz Base64 URL'si nedeniyle APP anahtarı alınamadı.

source: Start to convert ebook format...
tr: E-kitap formatını dönüştürmeye başla...

source: Starting to output subtitles file...
tr: Altyazı dosyasının çıktısı alınmaya başlanıyor...

source: The translation of the subtitles file was completed.
tr: Altyazı dosyasının çevirisi tamamlandı.

source: Starting to output PGN file...
tr: PGN dosyasının çıktısı alınmaya başlanıyor...

source: The translation of the PGN file was completed.
tr: PGN dosyasının çevirisi tamamlandı.

source: [{} > {}] Translating "{}"
tr: [{} > {}] "{}" Çevriliyor

source: Translation job failed
tr: Çeviri işi başarısız oldu

source: completed
tr: tamamlandı

source: Ebook Translation Log
tr: E-kitap Çeviri Günlüğü

source: Translation Completed
tr: Çeviri Tamamlandı

source: The translation of "{}" was completed. Do you want to open the book?
tr: "{}" çevirisi tamamlandı.

source: Translation canceled.
tr: Çeviri iptal edildi.

source: No available API key.
tr: Kullanılabilir API anahtarı yok.

source: API key was Changed due to previous one unavailable.
tr: API anahtarı öncekinin kullanılamaması nedeniyle değiştirildi.

source: Failed to retrieve data from translate engine API.
tr: Çeviri motoru API'sinden veri alınamadı.

source: Original: {}
tr: Orijinal: {}

source: Status: Failed {} times / Sleeping for {} seconds
tr: Durum: {} kez başarısız oldu / {} saniye boyunca uyuyor

source: Error: {}
tr: Hata: {}

source: Translating: {}/{}
tr: Çeviriliyor: {}/{}

source: Translation: {}
tr: Çeviri: {}

source: Translation (Cached): {}
tr: Çeviri (Önbelleğe Alınmış): {}

source: Start to translate ebook content
tr: E-kitap içeriğini çevirmeye başla

source: Item count: {}
tr: Ürün sayısı: {}

source: There is no content need to translate.
tr: Çevirilmesi gereken içerik yok.

source: Translation failed.
tr: Çeviri başarısız oldu.

source: General
tr: Genel

source: Content
tr: İçerik

source: Preferred Mode
tr: Tercih Edilen Mod

source: Output Path
tr: Çıkış Yolu

source: Library
tr: Kütüphane

source: Path
tr: Yol

source: Choose a path to store translated book(s)
tr: Çeviri kitap(lar)ı depolamak için bir yol seçin

source: Preferred Format
tr: Tercih Edilen Format

source: Merge to Translate
tr: Çevirmek için Birleştir

source: Enable
tr: Etkinleştir

source: The number of characters to translate at once.
tr: Bir kerede çevrilecek karakter sayısı.

source: Test
tr: Deneme

source: Cache
tr: Önbellek

source: Manage
tr: Yönet

source: Job Log
tr: İş Günlüğü

source: Show translation
tr: Çeviriyi göster

source: Search Paths
tr: Arama Yolları

source: The plugin will search for external programs via these paths.
tr: Eklenti bu yollar aracılığıyla harici programları arayacaktır.

source: Custom
tr: Özel

source: Usage Tip
tr: Kullanım İpucu

source: Tip:
tr: İpucu:

source: API keys will auto-switch if the previous one is unavailable.
tr: API anahtarları, öncekinin mevcut olmaması durumunda otomatik olarak geçiş yapacaktır.

source: Preferred Language
tr: Tercih Edilen Dil

source: HTTP Request
tr: HTTP İsteği

source: Concurrency limit
tr: Eşzamanlılık sınırı

source: Interval (seconds)
tr: Aralık (saniye)

source: Attempt times
tr: Deneme süreleri

source: Timeout (seconds)
tr: Zaman aşımı (saniye)

source: Abort Translation
tr: Çeviriyi İptal Et

source: Max errors
tr: Maksimum hatalar

source: The number of consecutive errors to abort translation.
tr: Çeviriyi iptal etmek için ardışık hataların sayısı.

source: Tune Gemini
tr: İkizler'i Ayarla

source: Prompt
tr: İstem

source: Sampling
tr: Örnekleme

source: Endpoint
tr: Son nokta

source: Enable streaming text like in ChatGPT
tr: ChatGPT'deki gibi metin akışını etkinleştir

source: Stream
tr: Yayın

source: Tune ChatGPT
tr: ChatGPT'yi Ayarla

source: Tune Claude
tr: Claude'yi dinle

source: The model depends on your Azure project.
tr: Model, Azure projenize bağlıdır.

source: Below original
tr: Orijinalin altında

source: Above original
tr: Orijinalin üstünde

source: Right to original
tr: Orijinal hakkı

source: Left to original
tr: Orijinale sola

source: With no original
tr: Orijinali yok

source: Translation
tr: Çeviri

source: Column Gap
tr: Sütun Boşluğu

source: Percentage
tr: Yüzde

source: Space count
tr: Boşluk sayımı

source: Translation Position
tr: Çeviri Konumu

source: Original Text Color
tr: Orijinal Metin Rengi

source: e.g.,
tr: örneğin,

source: Translation Text Color
tr: Çeviri Metni Rengi

source: Translation Glossary
tr: Çeviri Sözlüğü

source: Choose a glossary file
tr: Bir sözlük dosyası seç

source: Ignore Paragraph
tr: Paragrafı Yoksay

source: Scope
tr: Kapsam

source: Text only
tr: Yalnızca metin

source: HTML element
tr: HTML öğesi

source: Mode
tr: Mod

source: Normal (case-sensitive)
tr: Normal (büyük/küçük harfe duyarlı)

source: Regular Expression
tr: Normal İfade

source: Exclude paragraph by keyword. One keyword per line:
tr: Paragrafı anahtar kelimeye göre hariç tut.

source: Exclude paragraph by case-sensitive keyword. One keyword per line:
tr: Paragrafı büyük/küçük harfe duyarlı anahtar sözcükle hariç tut.

source: Exclude paragraph by regular expression pattern. One pattern per line:
tr: Paragrafı normal ifade düzeniyle hariç tut.

source: Ignore Element
tr: Öğeyi Yoksay

source: CSS selectors to exclude elements. One rule per line:
tr: Öğeleri dışlamak için CSS seçicileri.

source: Ebook Metadata
tr: E-kitap Meta Verisi

source: Append target language to title metadata
tr: Hedef dili başlık meta verilerine ekle

source: Set target language code to language metadata
tr: Hedef dil kodunu dil meta verilerine ayarla

source: Subjects of ebook (one subject per line)
tr: E-kitabın konuları (her satıra bir konu)

source: Language Mark
tr: Dil İşareti

source: Language Code
tr: Dil Kodu

source: Append Subjects
tr: Konu Ekle

source: Proxy host or port is incorrect.
tr: Proxy ana bilgisayarı veya bağlantı noktası yanlış.

source: The proxy is available.
tr: Proxy kullanılabilir.

source: The proxy is not available.
tr: Proxy kullanılamıyor.

source: the prompt must include {}.
tr: istem {} içermelidir.

source: Invalid color value.
tr: Geçersiz renk değeri.

source: The specified glossary file does not exist.
tr: Belirtilen sözlük dosyası mevcut değil.

source: {} is not a valid regular expression.
tr: {} geçerli bir normal ifade değil.

source: {} is not a valid CSS seletor.
tr: {} geçerli bir CSS seçici değil.

source: Translate Book
tr: Kitabı Çevir

source: Translate Ebook Content
tr: E-kitap İçeriğini Çevir

source: Setting
tr: Ayar

source: About
tr: Hakkında

source: Please choose one single book.
tr: Lütfen tek bir kitap seçin.

source: Please choose at least one book.
tr: Lütfen en az bir kitap seçin.

source: Cannot change setting while book(s) are under translation.
tr: Kitap(lar) çeviri aşamasındayken ayar değiştirilemez.

source: Cannot manage cache while book(s) are under translation.
tr: Kitap(lar) çeviri aşamasındayken önbellek yönetilemiyor.

source: Cache Manager
tr: Önbellek Yöneticisi

source: Choose Translation Mode
tr: Çeviri Modunu Seçin
